<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"fc0c62b5f9832f05f091c7cd6d0f37394cca829bdbd28966c90447bf72efa0bd","plan_job_ref":"Job Staging Environment #71 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/8412481618","plan_out_hash":"90e148d5d4107221fbd2a5ff5e3d890be01c4e1657f9ecc5e727f71b4fc7dadf","plan_hash":"0d1ccd1a5e088ec9ef3bda7c0189991bb9075f9f94c29708c40bcb4b3507ecb2","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "EOUIG3G6N7CQQ"
        tags                           = {}
#        (21 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (3 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                   = "c639ff85c30bd9303adbb801a8d29685" -> "5dcf5ad118cae883e3408a5efa1ed182"
        id                     = "index.html"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #71](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/8412481618)